{
  "work": [
    {
      "title": "Software Engineer Intern",
      "company": "The Difference App LLC",
      "duration": "June 2025 - Present",
      "description": "Remote internship supporting backend development and collaborative engineering processes for a health-focused startup.",
      "technologies": ["React", "Express.js", "Node.js", "SQL", "Tailwind CSS"],
      "achievements": [
        "Refactored the administration console backend using Node.js and Express.js to enhance performance and streamline user data tracking, client requests, and personalized health data access",
        "Redesigned subscription screens for improved user accessibility, resolved bugs, and implemented Android notification services for subscription purchases, contributing to both front-end and back-end development"
      ]
    },
    {
      "title": "Freelance Web Developer",
      "company": "Self-Employed",
      "duration": "May 2025 - June 2025",
      "description": "Remote freelance work developing modern web solutions for local businesses to enhance their online presence and operational efficiency.",
      "technologies": ["React", "Tailwind CSS"],
      "achievements": [
        "Developed and deployed a modern portfolio site for a local barber business using React and Tailwind CSS, increasing bookings by 20% and boosting monthly revenue by over $1,000",
        "Established the business's first online presence, enhancing Google discoverability and enabling direct client bookings through a fully responsive interface, improving client convenience"
      ]
    },
    {
      "title": "Software Engineer Intern",
      "company": "Evergreen Investments",
      "duration": "March 2025 - May 2025",
      "description": "Remote internship focused on developing automation solutions and custom tools to streamline business processes and improve operational efficiency.",
      "technologies": ["Deluge", "Zoho CRM", "JavaScript", "Zoho Desk", "CASA"],
      "achievements": [
        "Designed and implemented a property matching script using Deluge scripting and Zoho CRM, automating deal generation and improving lead-to-property match accuracy by 15%",
        "Developed and deployed a custom JavaScript sidebar widget in Zoho Desk, streamlining property ticket entry and increasing submission volume by 40% by removing the need to switch between CASA and CRM tabs"
      ]
    }
  ]
}
